#include <stdio.h> //Підключення бібліотек
#include <math.h>

int main() {
int n;
float f,r,e; //Змінні
printf ("\nЯким методом ви хочете виконати програму?\n");
printf ("З використанням скороченої форми оператора розгалуження if введіть 1\n");
printf ("З використанням повної форми оператора розгалуження if ... else або за необхідності вкладення if...else if введіть 2\n");
printf ("Вийти з програми введіть 3\n");
printf (" \n");

printf ("Введіть: "); //Введення чисел
scanf ("%d",&n); //Виведення
//Метод if
if (n==1){
  printf ("\nВведіть f: ");
  scanf ("%f",&f);
  printf ("Введіть r: ");
  scanf ("%f",&r);
  if (f==5) {
    e=3*f+2*r;
    printf ("Результат: %.2f",e);
  }
  if (f==0){
    if (2*f-4==0){
      printf("Ви ввели некоректне значення виконується ділення на 0");
    }
    else{
      e=sqrt(8*r)/(2*f-4);
      printf ("Результат: %.2f",e);
    }
  }
  if (f == -5){
    e=f*r-9;
    printf ("Результат: %.2f",e);
  }
  if (f!=5 && f!=0 && f!=-5){
    printf ("Ви ввели некоректне значення f");
  }
////////////////////////////////////////////////////////////////////////

//Початок else if
}
else if (n==2){
  printf ("\nВведіть f: ");
  scanf ("%f",&f);
  printf ("Введіть r: ");
  scanf ("%f",&r);

  if (f==5) {
    e=3*f+2*r;
    printf ("Результат: %.2f",e);
  }
  else if (f==0){
    if (2*f-4==0){
      printf("Ви ввели некоректне значення виконується ділення на 0");
    }
    else{
      e=sqrt(8*r)/(2*f-4);
      printf ("Результат: %.2f",e);
    }
  }
  else if (f==-5){
    e=f*r-9;
    printf ("Результат: %.2f",e);
  }
  else{
    printf ("Ви ввели некоректне значення f");
  }
}
}
